[
    {
        "id": 1,
        "title": "Java Developer",
        "offeredSalary": 1200000,
        "description": "1. Who we are: \n Leading in Germany and all over Europe, Laudert is a creative, strategic as well as operative partner in all matters of product communication for many renowned customers. Laudert is building a team for the priint Group. Founded in Germany, priint Group is the global leader in solutions that bring Product Data to life. Driven by the strong belief that timely and relevant marketing materials, digital and printed, are key to deliver an engaging customer experience, print Group enables organizations to create their marketing publications up to 80% more efficiently through cloud services and integration into virtually any data system. priint Group brings digital transformation and automation to the creative lifecycle. \n We are now looking for two Senior Full Stack Java Developers with in-depth knowledge of Java programming for priint Group’s project. We want you to learn all about our software suite and help build the software that our customers use daily. Our tasks are diverse, and you’ll be able to choose from a wide range of projects from backend webservices to data integration and even full stack roles. You’ll be able to express yourself by taking charge as a domain expert and you are expected to bring in your own ideas to improve the processes and make our products even better. We are providing an exciting environment and do everything to ensure your professional development. Join our team now! \n 2. What awaits you: \n A professional working atmosphere in a committed and successful team; \n Diverse and interesting projects with a high level of personal responsibility and independence; \n Flat hierarchies, appreciation and respect as well as a feel-good environment;",
        "city": "Hanoi",
        "responsibilities": "1. Design & Develop Software Systems: \n Collaborate with team members to design and break down application modules and functions based on business requirements; \n Build databases that meet business needs; \n Develop and maintain backend applications for web platforms; \n Integrate with middleware APIs to ensure end-to-end interaction flow; \n 2. Support Application Transfer: \n Train and transfer knowledge about the developed/deployed software systems to relevant units; \n 3. Handle System Errors and Issues: \n Receive, fix, and timely upgrade applications when errors arise or when there is a need to upgrade product features;",
        "requiredSkills": "Strong analytical, design, programming, and deployment skills for applications and software services; Proactive in learning and implementing new technologies; Open to changes or completely redoing projects when required; Teamwork skills and ability to read and understand English technical documents;",
        "workSchedule": "Full-time, Monday to Friday, 8:00 - 17:00",
        "keySkills": "Java, Spring Boot, RESTful APIs, SQL, Teamwork",
        "position": "Senior",
        "experience": "3 years of experience in software system development; Preferably experienced in the insurance sector or involved in programming system projects in the insurance field; Experience in project-based work, especially with Big Data, Data Analytics, OCR, AI projects is a plus;",
        "qualification": "Bachelor's degree in Information Technology (IT) or related fields;",
        "createdAt": "2024-06-25T08:30:00",
        "categoryId": 13,
        "companyId": 1
    }
]